//************************************************
// ŠÈ’P—p‚Ì•]‰¿ŠÖ”
//************************************************
#include "define.h"

boolean cpuCanPut(int[][4][4], int, int, int);

void easyValue(int puzzle[][4][4], int* x, int* y, int* z) {
    int i, j, k;
    int max = -999;
    boolean flg = false;
    //Šeƒ}ƒX‚Ì•]‰¿’l ’Pƒ‚É‚»‚±‚É’u‚¢‚½Žž‚Ìƒrƒ“ƒS‚É‚È‚è“¾‚é”‚ðŠî‚É‚µ‚Ä‚¢‚é
    int value[4][4][4] =
    {
        {{7,4,4,7},{4,4,4,4},{4,4,4,4},{7,4,4,7}},
        {{4,4,4,4},{4,7,7,4},{4,7,7,4},{4,4,4,4}},
        {{4,4,4,4},{4,7,7,4},{4,7,7,4},{4,4,4,4}},
        {{7,4,4,7},{4,4,4,4},{4,4,4,4},{7,4,4,7}}
    };

    /*******************************************************************************/
    // •]‰¿’l‚Ì‚‚¢Žè‚ªŒ©‚Â‚©‚Á‚½Žž‚Í‚»‚±‚ð•Ô‚·
    for (i = 3; i >= 0; i--) {
        for (j = 0; j < 4; j++) {
            for (k = 0; k < 4; k++) {
                if (puzzle[i][j][k] == OK) {
                    if (cpuCanPut(puzzle, i, j, k)) {
                        if (value[i][j][k] > max) {
                            max = value[i][j][k];
                            *x = i;
                            *y = j;
                            *z = k;
                            if (!flg) flg = true;
                        }
                    }
                }
            }
        }
    }
    // ”²‚¯–hŽ~‚Ì‚½‚ß‚Ìˆ—
    // Šî–{‚Ç‚±‚É‘Å‚Á‚Ä‚à•‰‚¯‚é‚Æ‚«‚É—¬‚ê‚é‚Í‚¸
    if (!flg) {
        for (i = 3; i >= 0; i--) {
            for (j = 0; j < 4; j++) {
                for (k = 0; k < 4; k++) {
                    if (puzzle[i][j][k] == OK) {
                        *x = i;
                        *y = j;
                        *z = k;
                    }
                }
            }
        }
    }
    return;
}